{
    "mom": [
        [
            {"text": "Lucy, thank goodness you are ok!", "condition": "mom", "condType": "equal", "condValue": "0"},
            {"text": "Lucy, why must you always make such a racket?! Get home and we will discuss your insolence later!", "condition": "mom", "condType": "equal", "condValue": "1"},
            {"text": "No buts, home now", "condition": "mom", "condType": "equal", "condValue": "2"}
        ],
    ]
    "dad": [
        [
            {"text": "We were so worried! Did you see the dragon?!", "condition": "dad", "condType": "equal", "condValue": "0"},
            {"text": "Yes, it has attacked a field of cattle outside of town. Killed almost half the herd!", "condition": "dad", "condType": "equal", "condValue": "1"},
        ],
    ]
    "lucy": [
        [
            {"text": "Dragon? Mom, dad, what dragon?! What are you talking about!", "condition": "dad", "condType": "equal", "condValue": "0"},
            {"text": "But how many dragons have you killed? And where exactly are you from? Why should we listen to you over our shaman?!", "condition": "lucy", "condType": "equal", "condValue": "1"},
            {"text": "But mother!", "condition": "lucy", "condType": "equal", "condValue": "2"}
        ],
    ]
    "ph": [
        [
            {"text": "I am sorry to hear that, but lucky for you I am a dragon knight from a far away land, and I can take care of this dragon for you.", "condition": "ph", "condType": "equal", "condValue": "0"},
            {"text": "Of course, dragon hunting is a hard and expensive job. I would need some sort of compensation for this task…..", "condition": "ph", "condType": "equal", "condValue": "1"},
            {"text": "CITIZENS!!!! This beast will destroy your homes and eat your children! Can you really afford not to have me take care of this beast! I am dragon knight, and this is what I do", "condition": "ph", "condType": "equal", "condValue": "2"}
            {"text": "Where are the parents of this...this girl?!  Who lets her speak to a knight with such disrespect?", "condition": "ph", "condType": "equal", "condValue": "3"}
        ],
    ]
     "shaman": [
        [
            {"text": "Please, please everyone, I need to you calm down. I have studied dragons ever since I was a young girl there has to be a reasonable explain….", "condition": "shaman", "condType": "equal", "condValue": "0"},
        ],
    ]
}


This is a basic house, very bare bones and simple. Lucy is pacing and extremely agitated. The Shaman enters through the only door. 


Shaman: “Oh child, thank goodness you are here. That stupid fool out there is going to get this town destroyed and no one is listening.”


Lucy: “What are we going to do? If the dragon comes here, it will destroy the village! There has to be another way.”


Shaman: “You are right, child. And what no one was willing to hear is that dragons rarely come near populated areas. They tend to hunt away from people, for they are intelligent creatures and know that if they stay out of sight, they will usually be left in peace. Something dire must have happened for it to come this close to our village for food. I have a tremendous task to ask you, Lucy, one that hope you will forgive me for putting on your shoulders. You are young and have always been stubborn and unwilling to accept the restrictions that our village has wanted to put on young ladies. Playing soldier with boys and climbing the tallest trees to prove you were braver than the boys. But at the same time, you were always compassionate to all around, bringing home wildlife for me to tend and heal.  Because of this, you are the only one I can trust with this task.”


Lucy looks out the window and turns back to the Shaman


Lucy: “What do you need of me?”


Shaman: “There is a cave not far from the village that supposedly holds a magical item that can communicate with animals and beast. It is only visible to those that are deemed pure of heart.  I myself have never been to this cave, but I know many in town know of its location. I need you to find the location of this cave and get that item. It may be the key to finding out why the dragon is attacking.  But you must hurry!”


At this point Lucy leaves and makes a decision to go home for supplies or talk to NPCs. 


Talk to NPCs:


She walks around town and encounters random NPCs…..




NPC1: That dragon just swooped in from the North. Must have come from Mt. KillAllMenWhoEnter.  I wonder how long it has been there.


NPC2: First, we hear reports of an invading army from the east, and now this.  What is this world coming too?!


NPC3: Did you hear about the Floyd’s boys? I guess those two rascals decided to go exploring “The Demon's Cave” down to the south east and came running back scared. They refuse to talk about what they saw there.  I would probably stay away from that cave. 




NPC4: OH NO DRAGON!!  (he should be panicked!!!)




NPC5: My necklace, oh where is my necklace???




Choose again: Go Home, go to Demon's Cave, go to dragon’s cave.




Go home option: Applicable no matter if you chose NPC first. 


Lucy sneaks to her house: Can hear her parents arguing in the living, tries to get upstairs without being seen.


Mom: “YOUNG LADY!!!”
Lucy freezes. Turns towards her parents:


Mom: “First, you go out this morning without telling us and then you disobeyed me when I said to go home? You have always been headstrong, but this is ridiculous. You could have been killed!”


Dad: “You are to go up to your room, and not come down till after this is all over!”


Lucy: “Mom, dad, Listen, PLEASE!”


Both parents: “GO, NOW!!”


Lucy stomps upstairs to her room. 


Lucy: “I have to get out of here, but how”




Can click random objects around room.


Window: (if nothing else has been picked up) “Yup, that is’t going to happen.”


Dresser: “My backpack would be useful (Option to take backback.)


Dresser: “Ew, I left this sandwich out and now it’s moldy!” 
Dresser: “Pocket mirror?”


Under bed: “My sewing kit may finally be useful” Acquire ball of twine and knitting needles.


Closet: “Hmmm, I have a bunch of old dresses I haven’t worn, I wonder if I can do something with these?”


Closet: “Hooded Cloak?”




Door: Sneak to parents room? Yes/No
Parent’s room:
Dresser: “Pocket Knife”
Dresser: “Couple Apples--and Dad yells at me for leaving food in my room.”
Dresser: “Fresh Sandwich”
Under Bed: “I know dad has some old camping stuff in here.” Acquire flint, tinder, small oil flask, strips of rags. and something else I will think of later.”
Closet: “sturdy walking stick”
Closet: “Comfy Shoes”


Sneak back to your room? Yes/No
 






Window: “I bet I could tie my dresses together and get down. My parents are already going to kill me….” 


“Tie dresses together and climb down?”  → Yes/No


Demon’s Cave--Without going home


You make your way to the cave straightaway. When you get to the entrance, you can barely see inside. As you step inside, there is just enough light to see about 20 feet in. You here strange noises coming from beyond the light.  


(Continue or go back for supplies?)


Continue:


Lucy starts to creep forward slowly, trying to let her eyes become accustomed to the dark.  She can see swirly dark shapes moving in the cave, she can try to navigate these. If one touches her, it burns?? And she she is touched by 3? Thought bubble, after first touch, (I probably shouldn’t let that happen too many more times)  sent back to beginning of the cave. This part can be done without supplies, just harder. 


In the middle of a the cave, she comes upon a pendant on a stalagmite. As she steps closer, a light comes shining down??? On the pendant.  She notices that the dark swirls are now staying far away. She steps towards the light and picks up the pendant. A bright light flashes and when it clears, the cave is clear of dark swirls and she is able to leave the cave, no issues. 




Demon’s Cave--With going home


You make your way to the cave straightaway. When you get to the entrance, you can barely see inside. As you step inside, there is just enough light to see about 20 feet in. You here strange noises coming from beyond the light. 


As she steps further into the cave, she sees swirly dark shapes. She also see sturdy sticks litter the floor.  At this point she is able to make the choice of looking in her pack for something useful. (hopefully use items to make torch.) 


She notices that when she lights torch, the black swirls stay away from her. (Still need to navigate, just much easier) 


In the middle of a the cave, she comes upon a pendant on a stalagmite. As she steps closer, a light comes shining down??? On the pendant.  She notices that the dark swirls are now staying far away. She steps towards the light and picks up the pendant. A bright light flashes and when it clears, the cave is clear of dark swirls and she is able to leave the cave, no issues. 




Choice- Go back to town or Go to dragon cave




Back to town
